GetSpatialElementCalculationPoint Method
Gets the location of the calculation point for this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ GetSpatialElementCalculationPoint()
Visual Basic
Public Function GetSpatialElementCalculationPoint As XYZ
Visual C++
public:
XYZ^ GetSpatialElementCalculationPoint()
Return Value
A 3d point.
Remarks
See HasSpatialElementCalculationPoint for reference.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown if this instance does not have a single calculation point.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →